docs/comp-sci/c.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>C Programming Language</title>
<meta name="author" content="Alex Nelson" />
<meta name="generator" content="Org Mode" />
<link rel="preconnect" href="https://fonts.gstatic.com"><link href="https://fonts.googleapis.com/css2?family=Spectral&display=swap" rel="stylesheet">
<link href="https://fonts.googleapis.com/css2?family=Merriweather" rel="stylesheet">
<div style="display: none"> \(
\DeclareMathOperator{\tr}{tr}
\newcommand\D{\mathrm{d}}
\newcommand\E{\mathrm{e}}
\newcommand\I{\mathrm{i}}
\newcommand\bigOh{\mathcal{O}}
\newcommand{\cat}[1]{\mathbf{#1}}
\newcommand\curl{\vec{\nabla}\times}
\newcommand{\CC}{\mathbb{C}}
\newcommand{\NN}{\mathbb{N}}
\newcommand{\QQ}{\mathbb{Q}}
\newcommand{\RR}{\mathbb{R}}
\newcommand{\ZZ}{\mathbb{Z}}
% For +---- metric
\newcommand{\BDpos}{}
\newcommand{\BDneg}{-}
\newcommand{\BDposs}{\phantom{-}}
\newcommand{\BDnegg}{-}
\newcommand{\BDplus}{+}
\newcommand{\BDminus}{-}
% For -+++ metric
\newcommand{\BDpos}{-}
\newcommand{\BDposs}{-}
\newcommand{\BDneg}{}
\newcommand{\BDnegg}{\phantom{-}}
\newcommand{\BDplus}{-}
\newcommand{\BDminus}{+}
\)</div>
<link rel="stylesheet" type="text/css" href="../css/stylesheet.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">C Programming Language</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#h-14a377e2-c9d5-4e9d-8932-36d37c2faf5a">1. Overview</a></li>
<li><a href="#h-414e26dd-b4dc-4212-8d7e-41dc60cd773b">2. Dereferencing NULL Pointer</a>
<ul>
<li><a href="#h-df00a2fd-d3ca-429c-8f91-21c0c6e022c8">2.1. On x86 Family Architecture</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-h-14a377e2-c9d5-4e9d-8932-36d37c2faf5a" class="outline-2">
<h2 id="h-14a377e2-c9d5-4e9d-8932-36d37c2faf5a"><span class="section-number-2">1.</span> Overview</h2>
<div class="outline-text-2" id="text-h-14a377e2-c9d5-4e9d-8932-36d37c2faf5a">
<p>
C is arguably the <i>lingua franca</i> of programming.
</p>

<p>
The "C Abstract Machine" is the hypothetical computer which is described
by the C standard (C17 5.1.2.3 "Program execution"), which states:
</p>

<blockquote>
<p>
The semantic descriptions in this International Standard describe the
behavior of an abstract machine in which issues of optimization are
irrelevant.
</p>
</blockquote>

<p>
This abstract machine may, or may not, have any relation to actual
hardware.
</p>

<p>
The basic model is that there are two memory locations:
</p>
<ul class="org-ul">
<li>The <dfn>stack</dfn> stores local variables and is cleaned up when the function
call terminates</li>
<li>The <dfn>heap</dfn> stores <code>malloc()</code> allocated results, must be
freed, and is accessed by pointers. Loosely, this intuitively
corresponds to RAM.</li>
</ul>
</div>
</div>
<div id="outline-container-h-414e26dd-b4dc-4212-8d7e-41dc60cd773b" class="outline-2">
<h2 id="h-414e26dd-b4dc-4212-8d7e-41dc60cd773b"><span class="section-number-2">2.</span> Dereferencing NULL Pointer</h2>
<div class="outline-text-2" id="text-h-414e26dd-b4dc-4212-8d7e-41dc60cd773b">
<p>
This leads to "undefined behaviour" according to the C Standard. This
means it depends on the CPU and other sordid details.
</p>
</div>
<div id="outline-container-h-df00a2fd-d3ca-429c-8f91-21c0c6e022c8" class="outline-3">
<h3 id="h-df00a2fd-d3ca-429c-8f91-21c0c6e022c8"><span class="section-number-3">2.1.</span> On x86 Family Architecture</h3>
<div class="outline-text-3" id="text-h-df00a2fd-d3ca-429c-8f91-21c0c6e022c8">
<p>
But that doesn't stop us from writing some code like:
</p>

<div class="org-src-container">
<pre class="src src-c"><span class="org-preprocessor">#include</span> <span class="org-string">&lt;stdlib.h&gt;</span>

<span class="org-type">int</span> <span class="org-function-name">main</span>() {
    <span class="org-type">int</span> *<span class="org-variable-name">x</span> = <span class="org-constant">NULL</span>;
    *x = 5;
    <span class="org-keyword">return</span> 0;
}
</pre>
</div>

<p>
We then check this compiles (using GCC 8.3.0) to:
</p>

<div class="org-src-container">
<pre class="src src-asm"><span class="org-comment-delimiter">; </span><span class="org-comment">gcc -fverbose-asm -S null.c -o null.s -O1</span>
<span class="org-function-name">main</span>:
    <span class="org-keyword">subq</span>    $40, <span class="org-variable-name">%rsp</span>    <span class="org-comment-delimiter">;</span><span class="org-comment">,</span>
    <span class="org-keyword">.seh_stackalloc</span> 40
    <span class="org-keyword">.seh_endprologue</span>
 <span class="org-comment-delimiter">; </span><span class="org-comment">null.c:3: int main() {</span>
    <span class="org-keyword">call</span>    __main   <span class="org-comment-delimiter">;</span>
 <span class="org-comment-delimiter">; </span><span class="org-comment">null.c:5:     *x = 5;</span>
    <span class="org-keyword">movl</span>    $5, 0    <span class="org-comment-delimiter">;</span><span class="org-comment">, MEM[(int *)0B]</span>
 <span class="org-comment-delimiter">; </span><span class="org-comment">null.c:7: }</span>
    <span class="org-keyword">movl</span>    $0, <span class="org-variable-name">%eax</span>     <span class="org-comment-delimiter">;</span><span class="org-comment">,</span>
    <span class="org-keyword">addq</span>    $40, <span class="org-variable-name">%rsp</span>    <span class="org-comment-delimiter">;</span><span class="org-comment">,</span>
    <span class="org-keyword">ret</span>     
</pre>
</div>

<p>
The key line of code is the <code>movl $5, 0</code> which tries to store in the
address at <code>0</code> the literal value <code>5</code>.
</p>

<ul class="org-ul">
<li>The pointers refer to a "virtual address", which is translated into
"physical addresses" via the operating system (in most modern
operating systems); this is done through paging</li>
<li>When the translation fails, the CPU raises a <dfn>page fault exception</dfn>
<ul class="org-ul">
<li>This triggers a transition from "user mode" to a specific location
in the OS kernel's code, as defined by the
<dfn>interrupt descriptor table</dfn></li>
</ul></li>
<li>The Operating System kernel regains control and must determine what to
do based on the information from the exception and the process's page
table.
<ul class="org-ul">
<li>Windows will (or used to) raise a <a href="https://learn.microsoft.com/en-us/windows/win32/debug/structured-exception-handling?redirectedfrom=MSDN">structured exception</a>.</li>
<li>Linux 2.6 had this be a possible exploit, see
<a href="https://web.archive.org/web/20160928150624/https://blogs.oracle.com/ksplice/entry/much_ado_about_null_exploiting1"> Much ado about NULL: Exploiting a kernel NULL dereference</a>.</li>
</ul></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="postamble">Last Updated: Sat, 2 Sep 2023 07:39:55 -0700
</div>
</body>
</html>
